Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 当硝烟散去时，紧闭的城门变成一个巨大的窟窿，窟窿约十一二米大，连城墙都被炸塌了一部分，守卫死伤最严重，哀嚎着躺在一堆碎石之中。
en_us: By the time the smoke cleared, the closed gates had become a huge hole about eleven or twelve meters wide. Even the city walls had been hit. The guards had the most injured and dead, lying amongst the rubble and moaning in pain.

source: 当花苞绽放到极致的时候，花苞突然喷出一股浓稠的黑色液体，江流根本没注意到这一变化，即使最后一刻察觉了，他也来不及反应，立刻被喷个正着。
en_us: When the flower bud was in full bloom, it suddenly sprayed a thick black liquid. Jiang Liu never noticed the change at all. Even if he perceived it at the last moment, he could not react in time and immediately got a head-on spray.

source: 当那些人再次赶到被扫荡过的洞府，一些人忍不住倒吸一口气，对方绝对是个圣境强者。
en_us: When those people rushed to the cave which had been cleaned-out, some could not help but gasp. The one who did this was definitely a Sacred Realm expert.

source: 当雷云酝酿到饱和状态的时候，一道黑色的雷劫突然凭空劈了下来，目标似乎正是那道蓝影。
en_us: When the thundercloud brewed till it was saturated, a black tribulation lightning suddenly struck from the sky without warning. The target seemed to be the blue shadow.

source: 当黄鼠獣反应过来的时候，他的大锤只剩下一百斤不到，含金量的手柄就已经超过五十斤，可想铁锤剩下有多少。
en_us: When the Ground Squirrel Beast reacted, his hammer weighed less than one hundred kilograms. As the metal handle which contained gold was already more than fifty kilograms, one could imagine how much of the hammer was left.

source: 当黑布落地时，众人死死的盯着托盘上的东西。
en_us: Everyone unwavering stared at the item on the tray when the black cloth fell onto the ground.

source: 彩丹他只炼了五颗，剩下的时间都以提升修为为主，不然等他找到黑莲草，他的修为不够也只能看着干瞪眼。
en_us: He had only refined five rainbow pills, and he used the rest of his time primarily on cultivating. Otherwise, by the time he found the black lotus herb (黑莲草), he would only be able to look at it if his cultivation base wasn't strong enough.

source: 彩级六品丹师的气势威压令客栈内很多人都喘不过气，有些甚至夸张的摔在地上，不过要补是夏音刻意控制她的威压不波及其他人，此时大部分估计已经受伤了。
en_us: The imposing pressure and aura of a Grade Six Rainbow Level mage made many people in the inn breathless. Some even exaggeratedly fell to the ground, but if Xia Yin had not deliberately controlled her pressure from spreading to the rest of the people, most would probably be injured now.

source: 彩级灵丹的丹方不好找，特别是品级越高的彩丹，几乎像绝迹一样，而且有些人就算有也不会拿出来，这些人多半还是有身份的人，根本不能强抢，虽然天修是有这个意思。
en_us: Pill recipes for rainbow pills were hard to find, especially higher grade ones, they were almost exstinct. Not only that, even if they had it, they wouldn't give it away and those people were usually one of power, so you couldn't even take it by force. It did seem like Tian Xiu had those intentions, however.

source: 待二人站稳身体，两人已经消失不见了踪影。
en_us: When the two regained their footing, the two outsiders had already disappeared without a trace.

source: 待他们反应过来，只有看到白影逃出自在阁的衣服一角，除此之外，白影似乎还带着一个人。
en_us: By the time they recovered, they only saw the corner of the white figure's robes as he had left the Leisure Pavilion. It also seemed as if the white figure was carrying someone.

source: 待他看清才发现竟然是一具无头尸体，可是没等他反应过来，无头尸体就变回原形了，要不是他退得快，很可能会被压在下面。
en_us: It was only after he took a closer look that he realized it was a headless corpse, but before he could react, the corpse returned to it's original form. If it wasn't for the fact that he had retreated quickly, he might've been crushed under it.

source: 待他走后，伙计甲才走过来，“掌柜的，他该不会是想逃走吧？”
en_us: Once he left, only then did the assistant walk over. "Concierge, it can't be that he wants to run away, right?"

source: 待游小默‘看’清识海里的东西，漩涡消失了，晶体也消失了，只剩下七道散发着不同颜色的火焰静静的悬浮着，火焰只有指甲盖大小，光芒略显暗淡。
en_us: Once You XiaoMo could 'see' the stuff within his sea of consciousness, the whirlpool and the crystal had disapperaed. All that was left was seven flames, all emitting a different color, calmly floating. The flames were only the size of a fingernail and they were a bit dim.

source: 待血影的主人消失后，游小默迫不及待的开口了，从他们的对话之中，他听出与他有很大的关系，作为当事人，他想他有权知道。
en_us: After the disappearance of the master of the blood shadow (待血影), You XiaoMo impatiently started speaking. He could tell that the content of their discussion had a great deal to do with him from their conversation. As the party involved, he thought he had the right to know about it.

source: 很多丹师在到处找不到想要的高级灵草时，通常会想到西境。
en_us: When many mages couldn't find the high-level magic herb they were seeking, they would often think of Western Continent.

source: 很多人一直以为通灵玄龟属性为水，实际上玄龟为木，白虎才是属水，一切自然而然有了解释。
en_us: There are many who believe that the Psychic Black Turtles are of the water element but in fact they are wood, white tigers were the ones with the water element. Now everything had a clear explanation.

source: 很多人在见到白虎的尸体后，第一反应就是把尸体据为己有，却不知，这恰恰就是机关启动的条件，他是在把玉床炼化成一滩液态时发现的，否则他也不会让游小默一个人去找水元素之心。
en_us: Many people, after seeing the corpse of the White Tiger, would immediately try to take it for themselves, not knowing that this was exactly what was required to activate the trap. This was something he had found out after he had turned the jade bed into a pool of liquid, otherwise he wouldn't have had You XiaoMo go and find the water elemental essence alone.

source: 很多人都认为游小默有凌霄的保护才能走到现在，理论上来讲他们的想法是对的，但是只对了一半。
en_us: Many believed that You XiaoMo was only able to get this far becuase of Ling Xiao. Theoritcally they're thought process was right, but only by fifty percent.

source: 很多天才也是和智商挂钩的，而他的身边有一个专门打击他自信的真正天才，他怀疑自己是不是又一次找虐。
en_us: Many geniuses had their IQs linked to their status as a genius. He also had a true genius around him who specialized in dealing shocks to his confidence. You XiaoMo wondered if he was looking for abuse again.

source: 很快的，妖凰族的动作也让他们深思起来。
en_us: Soon enough, the Demon Phoenix Clan's actions had them in deep contemplation.

source: 很快，他就知道凌霄带他来看什么好戏了。
en_us: Son enough, he knew what the show Ling Xiao had brought him here to watch was.

source: 得到允可，掌柜低眉顺眼的走进房间，不着痕迹的瞥了里面一眼，透过屏风他隐约看到一道模糊的人影。
en_us: With his consent, the shopkeeper walked in with his head lowered. However, seamlessly, he also took a peak and saw that blurry figure behind the screen. (屏风)

source: 得到许可后，游小默和凌霄一起走进去。
en_us: After receiving permission, You XiaoMo and Ling Xiao walked in together.

source: 得知他们要走，卫白急忙让傅苍穹带他过来。
en_us: Wei Bai hastily asked Fu CangQiong (傅苍穹) to bring him over upon knowing that they were about to leave.

source: 得知刑七的手臂也是被火烧伤的，黑熊立刻联想到凌霄，不过他没有将这件事说出去，因为他知道就算说出来，他们三个联手也不是那个男人的对手，所以他只是暗地里吩咐他的手下多注意一下。
en_us: After knowing that Xing Qi's arm had been burnt off, Hei Xiong's first thought was Ling Xiao, but he didn't say anything about it because he knew that even if he spoke out, the three of them combined wouldn't even be able to take that guy on.

source: 得知是游小默拜托他们的，武正比武成的阅历高，但是他没有深究，到日前为止，凌霄和游小默与他们都没有结过仇怨，若只是为了探听一个消息反而得罪十神榜的强者，那就得不偿失了。
en_us: Wu Zheng was more experienced than Wu Cheng. He did not perform an in-depth investigation upon knowing that You XiaoMo had requested their help. Till now, there had not been any hatred between them and Ling Xiao and You XiaoMo. The gains would not make up for the losses if they offended a powerhouse on the Ten Gods Ranking simply because they were snooping after a piece of information.

source: 得知黑熊只针对北面派了重兵把握，刑七和高殷越想越觉得不对劲，谁说莫景就一定要前往活水河界，他可以从南面离开暂时不去活水河界。
en_us: Both Xing Qi and Gao Yan had realized that Hei Xiong only heavily guarded the North side and the more they thought about it, the weirder it seemed. Who said that Mo Jing must leave for the Living Waters River Boundary, he could've left from the South and not go to the Boundary.

source: 心中稍有主意，游小默又看了下凌霄的情况才出门。
en_us: With a hint of an idea in his mind, You XiaoMo glanced at Ling Xiao's situation again before leaving.

source: 心脉丹刚好是三品灵丹，几张丹方中等级最高，以他的修为要一枚心脉丹倒是不难，不过心脉丹所需的灵草还有一些没有成熟。
en_us: The Heart Vein Pill just happened to be a grade three magic pill, and it had the highest rank among the pill recipes. With his cultivation base, it wasn't hard to refine a Heart Vein Pill, but some of the magic herbs that were required for the pill weren't ripe yet.

source: 心脉丹是一种彩级三品灵丹，在三品灵丹中等级颇高，它的作用比较多，第一个好处是可以平心精气，丹师服用此丹，在炼丹时可增加一定的成功机率，特别是在炼制顶级灵丹的时候。
en_us: The Heart Vein Pill was a type of grade three rainbow level magic pill. Its rank was quite high among the grade three magic pills, and it had many uses. Its first benefit was that it could calm the heart and qi energy. When mages used this pill, it could raise the success rate when refining pills, especially when refining transcendent level magic pills.

source: 心里刚闪过这个念头，一队十五人的守卫突然冲进院子，守卫队长看到唐中华立刻走上来。
en_us: Just as this though flashed through his mind, a team of fifteen guards suddenly rushed into the courtyard. The captain of the team saw Tang ZhongHua and immediately walked up.

source: 必须把这个消息传给妖凰族的长老。
en_us: She had to deliver this piece of information to the elders of the Demon Phoenix Clan.

source: 忘了走吧试探的敲下门，“客人，客人？”
en_us: Owner Wang knocked on the door to sound things out, "Hello, anyone?"

source: 怎么可能，这里怎么会出现第二只通灵玄龟？”玄泽的声音骤然响起，带着一股难以置信的震惊之色。
en_us: "How? How could there be another Psychic Black Turtle?" Xuan Ze said, unbelievably shocked.

source: 怎样就想走？
en_us: And you want to leave just like this?

source: 怕是见不着了吧。”
en_us: I'm afraid I won't be able to see her."

source: 思及此，凌霄回道：“古叔，我人现在就在鬼冢山脉。”
en_us: Considering this, Ling Xiao replied, "Uncle Gu, I am currently at the Ghost Tomb Mountain Range."

source: 思及此，黑熊突然拿出一个储物袋，随手扔给凌霄，“这是黑熊的一点心意，还请二位笑纳。”
en_us: Thinking it this far, Hei Xiong suddenly got a magic bag and casually threw it at Ling Xiao saying, "This is but a little show of my regard (心意); if you will accept it."

source: 总之他糊涂了。
en_us: In short, he was confused.

source: 总之众说纷纭，但每个猜测都有人反对。
en_us: In conclusion, there were many different opinions, yet every opinion had someone opposing it.

source: 总所周知，灵晶是通天大陆的流通货币，但价值同样很高，因为它除了可以作为交易的货币，还能在修炼的时候吸收灵晶的能量增长修为。
en_us: As everyone knew, though spirit gems were the currency in circulation in the TongTian Continent, its value was also very high. This was because it could be used as a trading currency and could also be used to raise one's cultivation base by absorbing the energy from the spirit gems during cultivation.

source: 总算不会无可救药！
en_us: At last he couldn't be considered hopeless! (总算不会无可救药?)

source: 总算是个勤快的，不像其他人，想要叫动他们总是要威逼利诱才行，游小默稍微安心了。
en_us: Finally someone who was hardworking, unlike the others who needed threatening or persuasion. You XiaoMo felt a little calmer.

source: 恶意哄抬价格，想让赤血家族大出血嘛！
en_us: This was maliciously bidding up the price to make the ChiXue Clan bleed money!

source: 恶趣味的事情他的反应总是特别快。
en_us: His reaction was always exceptionally fast towards such bad hobbies (恶趣味的事情).

source: 想了想，游小默干脆把玉简塞回凌霄手里。
en_us: After thinking for a while, You XiaoMo simply shoved the jade drive back into Ling Xiao's hands.

source: 想到凌霄圣境的修为，那人的脸色顿时变白了。
en_us: Remembering Ling Xiao's Sacred Realm power, his face instantly turned pale.

source: 想到水妖的原身是人类，游小默就无法认同他们是真正的妖兽，连忙催促凌霄离开沼泽。
en_us: When he remembered that the water demons' original bodies were that of humans, You XiaoMo had no way to identify if they were actual demon beasts, so he hastily urged Ling Xiao to leave the swamp.

source: 想到灵水的好处，滕梓心咬了咬贝齿，最后还是悄无声息的倒了五滴进去，量并不少，不过她还是略微心虚的往游小默的方向看了一眼。
en_us: Thinking of all the benefits the spiritual water could bring, Teng ZiXin gritted her teeth and poured five drops in. It wasn’t a small amount, but she still glanced in You XiaoMo’s direction with slight guilt.

source: 想到这，廖牙放下狠话道：“你别得意，虽然老大发过誓不会找你麻烦，但是发誓的人只是老大而已，我们会长可没发过誓，你就等着死吧。”
en_us: Thinking of that, Liao Ya said threateningly, "Don't think it's over. Though the boss won't come after you for now, he was the only one to make that promise. Our guild leader never promised anything. Just you wait."

source: 想到这，他突然感觉背后一寒。
en_us: Just as the thought passed through his mind, he suddenly felt a chill at his back.

source: 想到这，他紧张的扯了扯凌霄的袖子。
en_us: Once he thought of this, he nervously tugged at Ling Xiao's sleeve.

source: 想到这，夏音的速度突然慢了一点。
en_us: As she thought of this, Xia Yin suddenly slowed down.

source: 想到这，已经有人自发将他和凌霄剔除压轴物品的竞争。
en_us: As the thought crossed their mind, some already eliminated them as competitors for the final goods.

source: 想到这，很多人不禁犹豫了。
en_us: Thinking of this, many people couldn't help but hesitate.

source: 想到这，李管事连忙吼他道：“没用的家伙，还不快下去，尽丢人现眼，下次再犯这样的错误，你就给我滚蛋。”
en_us: Remembering this, Manager Li hurriedly shouted at him, "Useless assistant! Why aren't you leaving already, are you trying your best to make a fool out of yourself? If you make this kind of mistake next time, then you can scram!"

source: 想到这，游小默又将瓦片重新盖回去。
en_us: Thinking of this, You Xiaomo put the tile back once again.

source: 想到这，游小默立刻将凝成细丝的灵魂之力又重新凝聚在一起，看着灵魂之力之中一团团灵草液体，游小默深吸了一口气，集中精神准备开始炼丹。
en_us: Thinking of this, You XiaoMo brought back together the soul force he had made into thin threads. Looking at the pools of liquified magic herbs, You XiaoMo took a deep breath and focused on refining the pill.

source: 想到这，游小默立刻小声的给凌霄传音：“圣境强者的事要怎么办，你不打算现身吗？”
en_us: Thinking of this, You XiaoMo immediately whispered to Ling Xiao, "What are we going to do about the Sacred level practitioner? Are you planning to reveal yourself?"

source: 想到这，游小默立刻瞪向凌霄。
en_us: Thinking it this far, You XiaoMo turned to glare at Ling Xiao.

source: 想到这，游小默立刻让凌霄把皮球他们从空间里放出来，本来打算让他们自由活动，结果又发生了一些意外事件，而且这次恐怕也不能带他们去中天了，人多目标会更大。
en_us: Once he thought of that, You XiaoMo quickly got Ling Xiao to pull PiQiu and the others out of his dimension. At first he was going to let them have thier free time, but suddenly some unforseenable events happened and they wouldn't be able to take them to Zhong Tian. With more people, the target was bigger too.

source: 想到这，游震天翻了下右手掌，一条碧绿色的小蛇出现在他手上，这条小蛇与游明当初的契约兽碧妖蛇一般无二，但还是有所不同。
en_us: Once he thought of this, You ZhenTian turned his right hand over. A small dark green snake appeared on his hand. This snake was exactly alike to You Ming's contracted demon beast, the Jade Devil Snake (碧妖蛇), yet it differed to some extent.

source: 想到这，玄威突然反应过来那句‘自己送上门来’的话，眼睛骇然的盯着男人，他该不会是想将他炼化了？
en_us: Thinking of this, Xuan Wei suddenly remembered how the other had said something about "sending yourself right to my door" and stared at the other in shock. Did the other intend to refine (炼化) him?

source: 想到这，黑熊急忙喊道：“慢着！”
en_us: Realizing this, Hei Xiong hurriedly shouted, "Hold up!" (wait慢着)

source: 想在事后把他踢出局，也要看他的拳头同不同意，黑蜘蛛的人可不是好欺负的，而且向来只有黑蜘蛛欺负别人的份。
en_us: If they wanted to kick him out after finishing things up, they would still have to see whether his fists agreed or not. The people from the Black Spider weren't easily bullied. Moreover, it had only ever been the Black Spider bullying other people.

source: 想当初，他对灵草也是一窍不通，后来游小默每次把他拉进空间时总会在他耳朵边念叨着这些事情，久而久之，凌霄不懂也得懂。
en_us: He reminisced of the things in the beginning. He had also lacked the slightest knowledge about magic herbs. You XiaoMo would always be harping about these matters beside his ear when he dragged Ling Xiao into his dimension afterwards. As time went on, Ling Xiao had to understand it even if he did not in the beginning.

source: 想来想去，最后只有炼丹赚钱一路。
en_us: He thought about it over and over before finally deciding that there was only the option to refine pills.

source: 想要将隐藏血脉彻底激发出来就要用等级高的精血，如此血脉才会越纯，激发血脉带来的好处就会越好，以前他不知道，所以才会用银龙的血激发出龙族的血脉，幸好最后还是成功了。
en_us: If he wanted to activate those hidden bloodlines, then he needed very high grade blood. That sort of blood would be purer, and he'd benefit more from activating these bloodlines. He hadn't realized this before and had used silver dragon blood to activate his dragon clan bloodline. It was just fortunate that it had succeeded in the end.

source: 想要拿下小岛，除非像以前一样直接攻击小岛，这样一来，整座小岛势必会毁于一旦。
en_us: If they wanted to seize the small island, there wasn't much they could do besides directly attacking the small island like before. If they did this, the entire island would be destroyed in an instant.

source: 意见可大了！
en_us: Too many issues!

source: 意识就是先不去玄龟族。
en_us: This meant that they were not going to the Black Tortoise Clan first.

source: 感情您老人家从刚一开始就在想着怎么趁火打劫。
en_us: Of course, an old man like you (感情您老人家) was only thinking of how to loot a burning house from the very beginning.

source: 感觉又不太可能！
en_us: This is not seem too probable!

source: 感觉好像更引人注意了。
en_us: By the looks of things, they were even more eye-catching than before.

source: 愤怒泄露了他的杀气。
en_us: His anger revealed his killing intent.

source: 戏谑带着浓浓趣意的声音自男人身后响起。
en_us: A bantering/ridiculing tone carrying strong interest rang from behind the man.

source: 成熟的灵草是他刚好随身捎带的，种子和幼苗则是沿途购买的，这些的价值比成熟的低很多，虽然市场不大，但是仍然能买到，之前他还担心游小默会不高兴。
en_us: It just so happened that he was carrying mature magic herbs with him. The seeds and seedlings were purchased along the way and these were much less valuable than mature magic herbs. Although the marketplace was small, he was still able to purchase them. Previously, he was even worried that You XiaoMo would be dissatisfied.

source: 成衣店有外来者闹事的消息传得很快，等他回来的时候，掌柜和伙计们已经听说了那件事，他们怀疑可能是游小默，刚回房不久，掌柜就上来试探他的口风。
en_us: The news of an outsider causing a disturbance in the garment store spread quickly. By the time he came back, the shopkeeper and his assistants had heard about it. They suspected that it might be You XiaoMo. The shopkeeper (掌柜) came up to sound him out not long after he returned to his room.

source: 成衣店的人都被游小默的气势给吓到，一个个都没反应过来，街上的人发现里面的异状，纷纷堵在门口围观。
en_us: The people in the garment shop (成衣店) were frightened by You XiaoMo's aura and each and everyone did not react. The people on the streets discovered the abnormality inside and crowded at the doorway to watch.

source: 成衣店的店主是个老板娘，徐娘半老。
en_us: The owner of the tailor shop was a proprietress, middle-aged but still attractive.

source: 我一定要把他们碎尸万段！”
en_us: I will definitely dismember them into ten thousand pieces!"

source: 我不是说了我同伙会把偷走的东西拿过来换我，你不也听到了。”游小默脑门浮现一个问号，难道他没听到他跟凌霄的对话，虽然对话怪，但不是可以证明他确实有‘同伙’。
en_us: Didn't I just say my accomplice will return what we stole to you? You heard me talk to him." A question mark rose in You XiaoMo's mind. Could it be that the other hadn't heard his and Ling Xiao's conversation? Though their conversation was strange, it could prove that he had an accomplice.

source: 我不能留下你一个人，就算他不会杀你，但是难保他不会对你做其他事情。”
en_us: I can't leave you here by yourself. Even if he won't kill you, it's hard to ensure that he won't do something else to you."

source: 我们也是迫于无奈才会干这种抢劫的勾当，我保证以后绝对不会再犯。”掌柜被他的凶残吓得屁滚尿流，他越发肯定游小默就是白天大闹成衣店的那个少年。
en_us: We only rob people because we're forced to. We promise to never do this again!" The shopkeeper was scared witless by his viciousness. He dared to bet that You XiaoMo was the young man that had caused that commotion at the clothes shop earlier today.

source: 我们还有重要的事情，这次真的要走了，你也赶紧离开这里吧，不然那个叫邢七的和他的同伙说不定还会再回来。”游小默直起身，他的好奇心已经满足了。
en_us: We still have important things to take care of, so this time we really have to go. You should hurry and leave this place too, or else that guy called Xing Qi and his pals will most likely come back again." You XiaoMo stood up. His curiosity had already been fulfilled.

source: 我看你明明玩得挺高兴的，从北面跑到西面，真的好有兴致，我看了都好羡慕哦。”
en_us: From what I've see, you seem to be having fun, running from the south wing to the west wing. You seemed to have been enjoying yourself, I'm almost jealous."

source: 我还说我是苍盟盟主最宠爱的徒弟呢。”
en_us: Then I'll say that I'm the most favored disciple of the Head of the Cang Alliance."

source: 我还赶着回去呢！”
en_us: I'm still in a hurry to go back!"

source: 戒指是芥子空间，和储物袋不同，一旦认主就无法再取下来，这也是花姑他们为什么没有取下戒指的原因，而且他们很少看到芥子空间，所以没发现也是正常的。
en_us: The ring was a mustard dimension (芥子空间). Unlike a magic bag, it was unable to be removed once it recognized an owner. This was also why the three did not remove the ring. Furthermore, they had rarely seen a mustard space, so it was normal for them not to recognize it.

source: 或许他错估对方的实力。
en_us: Perhaps he had miscalculated the other's strength.

source: 或许可以理解为，游小默脱口说出这句话的时候，众人菊花肯定紧过。
en_us: Or, it could understood as, when You XiaoMo said this, everyone definitely clenched their butts.

source: 房间很小，只有一张床，然后就什么都没有了，桌子椅子柜子，喝水用的杯子统统都没有。
en_us: The room was small, with only one bed and nothing else. There were no tables, cabinets, and it was also without cups for drinking water.

source: 房间很快只剩下他们三人。
en_us: Very quickly, only the three of them were left in the room.

source: 房间的人沉默了几秒，“有没有茶？”
en_us: After a moment of slience, he asked, "Is there tea?"

source: 房间里，游小默正聚精会神的看着凌霄，门突然敲响了。
en_us: In the room, You XiaoMo was concentrated on staring at Ling Xiao when there was a sudden knock on the door.

source: 房间里，游小默考虑再三决定出门一趟。
en_us: Inside the room, You XiaoMo considered it over and over before deciding to go outside again.

source: 房间里，颜辉看了眼被踹下来的两扇门，头痛的揉了揉太阳穴，“苏朗，从昨天到现在，你已经连续踹坏我两次门。”
en_us: In the room, Yan Hui glanced at the two door panels that had been kicked down, and he rubbed his temples. "Su Lang, you've already kicked down my door twice from yesterday till today."

source: 所以说，乌梅镇繁荣的真正原因其实是黑蜘蛛的拍卖会，那个拍卖会就位于乌梅镇的地底下。
en_us: Therefore, the real reason for the Ebony Plum Town's prosperity was actually due to the auction of the Black Spider, which was located underground beneath Ebony Plum Town.

source: 所以今天突然遇到一个反抗的人，大家都懵了。
en_us: Therefore, everyone was struck dumb (懵) when they suddenly met a rebellious person today.

source: 所以他一直在等凌霄的到来。
en_us: Therefore, he had been waiting for the arrival of Ling Xiao.

source: 所以他一问价格，老板娘嘴巴立刻像跑火车一样，而且睁眼说瞎话的境界显然十分高深。
en_us: So the moment he asked about the price, the proprietress instantly started running her mouth like a train. Moreover, she seemed to be very adept at spewing nonsense.

source: 所以他现在别无选择，怪只怪他判断错误，什么人不挑，非得和滕蛟联手动凌霄，也不想想，在游小默得罪了那么多人后，还能跟他一起的男人会那么简单吗？
en_us: So he had no choice. The blame lay on his mistake in judgement. Out of everyone, he just had to go after Ling Xiao with Teng Jiao. He didn’t even think, after angering so many people, could the person who remained at You XiaoMo’s side be so simple?

source: 所以众人才会对凌霄不以为意，一个只在通天大陆生活了一百年，在中级位面却待了万年，他的修为能有多高？
en_us: Therefore, everyone did not put Ling Xiao into their eyes. How high can the cultivation of a person that only lived in the TongTian Continent for one hundred years and stayed in the Middle Level Realm for ten thousand years be?

source: 所以其实所有赶到这里的人都抓过黑鸦，只不过他们都在大山外面就把黑鸦放走。
en_us: So all the people who arrived here actually caught their black crows, but they released them outside the mountain.

source: 所以在与水妖战斗的时候，除非有能力直接灭杀水妖，否则大部分人都会先削掉它们的四肢，防止被抓伤。
en_us: Thus, when fighting a Water Demon, unless you had the strength to annihilate it immediately, mostly would sever it's limbs first, to protect from being scratched.

source: 所以在沸沸扬扬的闹了近十天，事件总算稍微平息下来。
en_us: The incident finally calmed down slightly after almost ten days of chaos.

source: 所以就算少主的实力是神境七星巅峰，差距也不是追不上，用差距太大来形容实为不妥。
en_us: Therefore, the gap shouldn’t be too huge even if the strength of the Young Master was at seven star pinnacle Divine Realm (神境七星巅峰). Using ‘the difference is too big’ to describe this was not the right thing to do (实为不妥).

source: 所以尽管麟昊武不愿意，带他来的人都准备找凌霄谈一谈，若能劝他回麒麟族那便更好。
en_us: Thus, regardless of Lin HaoWu's personal feelings, the others all wanted to find and talk to Ling Xiao to persuade him to go back to the Qilin Clan.

source: 所以尽管赤血家族不服气，但是面对意见一致的四大势力，他们也只有把所有的不满都吞回肚子里，谁让他们的人比较少，连五个人都没有，其中还有一个是‘瞎子’。
en_us: So even if the Vermillion Blood Clan was unwilling, in the face of the like-minded four major powers, they had no choice but to swallow all of their discontent back down. Who let them have so few people? They didn't even have five people total, one of which was even a 'blind person.'

source: 所以得知这个消息后，他并不打算去，一来他对通天殿没什么兴趣，二来他的事情不少，心里有许多惦记的事情，所以兴致不高。
en_us: So he did not intend to go after learning this news. First, he had no interest in the TongTian Palace. Second, he was not very interested as he had many things to do and had many things he was concerned about.
